---
type: CADLinkType
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# CADLinkType

`Autodesk.Revit.DB.CADLinkType` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | LoadFrom | — | `` |
| Method | Reload | — | `` |
| Method | Reload | 2018 | `public LinkLoadResult Reload ()` |
| Property | Parameter | — | `` |